<a href="https://colab.research.google.com/github/SamanthaHassal/Shopify-Data-Science-Challenge/blob/main/Shopify_data_science_challenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import date

In [ ]:
#read the data set
dt = pd.read_csv("2019 Winter Data Science Intern Challenge Data Set - Sheet1.csv")
dt.head()

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11

In [ ]:
# Average order value: revenues / number of orders
# we've been told the AOV = $3145.13
# this looks wrong given that these stores all sell sneakers, a low-cost type of footwear
# start by finding the most expensive transaction 
max_rev = max(dt['order_amount'])
max_data = dt[dt['order_amount']==max_rev]
max_data # one user at one store ordering 2000 pairs of shoes!

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
15,16,42,607,704000,2000,credit_card,2017-03-07 4:00:00
60,61,42,607,704000,2000,credit_card,2017-03-04 4:00:00
520,521,42,607,704000,2000,credit_card,2017-03-02 4:00:00
1104,1105,42,607,704000,2000,credit_card,2017-03-24 4:00:00
1362,1363,42,607,704000,2000,credit_card,2017-03-15 4:00:00
1436,1437,42,607,704000,2000,credit_card,2017-03-11 4:00:00
1562,1563,42,607,704000,2000,credit_card,2017-03-19 4:00:00
1602,1603,42,607,704000,2000,credit_card,2017-03-17 4:00:00
2153,2154,42,607,704000,2000,credit_card,2017-03-12 4:00:00
2297,2298,42,607,704000,2000,credit_card,2017-03-07 4:00:00
2835,2836,42,607,704000,2000,credit_card,2017-03-28 4:00:00
2969,2970,42,607,704000,2000,credit_card,2017-03-28 4:00:00
3332,3333,42,607,704000,2000,credit_card,2017-03-24 4:00:00
4056,4057,42,607,704000,2000,credit_card,2017-03-28 4:00:00
4646,4647,42,607,704000,2000,credit_card,2017-03-02 4:00:00
4868,4869,42,607,704000,2000,credit_card,2017-03-22 4:00:00
4882,4883,42,607,704000,2000,credit_card,2017-03-25 4:00:00

In [ ]:
#remove this person from the data set
outlier_free_data = dt[dt['order_amount']<max_rev]
AOV_better = sum(outlier_free_data['order_amount'])/sum(outlier_free_data['total_items'])
outlier_free_data

,order_id,shop_id,user_id,order_amount,total_items,payment_method,created_at
0,1,53,746,224,2,cash,2017-03-13 12:36:56
1,2,92,925,90,1,cash,2017-03-03 17:38:52
2,3,44,861,144,1,cash,2017-03-14 4:23:56
3,4,18,935,156,1,credit_card,2017-03-26 12:43:37
4,5,18,883,156,1,credit_card,2017-03-01 4:35:11
...,...,...,...,...,...,...,...
4995,4996,73,993,330,2,debit,2017-03-30 13:47:17
4996,4997,48,789,234,2,cash,2017-03-16 20:36:16
4997,4998,56,867,351,3,cash,2017-03-19 5:42:42
4998,4999,60,825,354,2,credit_card,2017-03-16 14:51:18
4999,5000,44,734,288,2,debit,2017-03-18 15:48:18

In [ ]:
AOV_better # order of magnitiude 10**2

378.1843800322061

In [ ]:
#compare against the raw data set
AOV_raw = sum(dt['order_amount'])/sum(dt['total_items'])
AOV_raw # also order of magnitiude 10**2 

# since the report said that AOV was on the order of mangitude 10**3, I think the number of orders were miscalculated

357.92152221412965

In [ ]:
# issues with AOV - affected by number of orders (small order numbers boosts up the ratio)
#                 - affected by cost of orders/distribution of cost 
#                  (common tactic to boost AOV is to move more expensive goods)

In [ ]:
# better metric - average number of units sold per transaction
avg_units_sold = np.mean(dt['total_items'])
avg_units_sold

8.7872

In [ ]:
avg_units_sold_outlier_free = np.mean(outlier_free_data['total_items'])
avg_units_sold_outlier_free

1.9939795304033714